Examples/BasicSourceSubclasses/pitzDailyWithImplicitSource/constant/sourcesProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      sourcesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

plug
{
    type vectorSwakImplicitSource;

    active true;
    timeStart 0;
    duration 1e7;
    selectionMode all;

    vectorSwakImplicitSourceCoeffs {
        switchExplicitImplicit true;

        variables (
            "xMin=0.05;"
            "xMax=0.075;"
            "resist=1e3;"
        );

        expressions {
            U "(pos().x<xMax && xMin<pos().x ? -resist : 0)";
        }

        dimensions [0 0 -1 0 0 0 0];
    }
}


// ************************************************************************* //
